// 1. 문제를 풀고 해설 링크를 무조건 보자. (내 코드와 비교)
// 2. 해설 링크(코드)만 봐서 이해가 안될 경우에는 강의를 듣자. (강의를 무조건 들어도 된다.)
// 3. 히든퀘스트 꼭 풀자

// 강의 200% 활용법
// 1. 절대 알고리즘 분류를 보지말자.
//		: 주차별로 주차에 관한것 뿐만 아니라 랜덤적으로 구현 등의 문제를 넣었다! 실제 코딩테스트 처럼 시간재가면서!!
// 2. 한달 뒤 코테? 
//		: 3일안에 60페이지 교안을 다 외워라!(무리한 부탁 절대 아님) + 4주차까지, 좀 시간이 남는다? 5주차까지 하세요.
// 3. 모든 강의를 듣고 시간이 남았다?
//		: 1. 프로그래머스 기출
//		: 2. 상호배타적집합, MST
//		: 3. 틀린거 다시 풀기
//		: 4. 목표가 Google이라면 codeforce(세계 프로그래밍 대회)
//		: 5. 하루에 1~3문제씩 감을 잃지 말기(레벨 골드 이상급으로)

// 알고리즘 교안 제대로 공부하는 방법
// -> 종이로만 보고 이해 안되면 직접 쳐보고 이해하자.